validation/anisoConduction/0/a
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Orientation tensor for the anisotropic-conduction benchmark: fibres fully
    aligned with y, the direction of the imposed temperature gradient, so the
    conductivity along the gradient is kappa (1 + 2/3 conductivityAnisotropy).
    The melt is static, so the tensor does not evolve.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      a;
}
dimensions      [];

internalField   uniform (0 0 0 1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    hotWall
    {
        type            zeroGradient;
    }

    coldWall
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}
